src/InformationRegisters/Scan_МатрицаТарифовПоДоставкеИзделий/Scan_МатрицаТарифовПоДоставкеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаТарифовПоДоставкеИзделий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость1Км</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураУслуги</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПродукта</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_РасстояниеМеждуАдресами/Scan_РасстояниеМеждуАдресами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_РасстояниеМеждуАдресами</name>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_СтавкиНДС/Scan_СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтавкиНДС</name>
  <predefined>
    <items>
      <name>ОсновнаяСтавкаНДС</name>
      <description>18%</description>
    </items>
    <items>
      <name>ОсновнаяСтавкаНДССтарая</name>
      <description>20%</description>
    </items>
    <items>
      <name>БезНДС</name>
      <description>Без НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>Ставка</name>
    <comment>Ставка налога на добавленную стоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Scan_МатрицаТарифовПоДоставкеИзделий/Forms/ФормаЗаписи/Module.bsl
//rarus abrant 17.07.2017 mantis 9146 +++
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	СуммаПриИзмененииНаСервере()
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзмененииНаСервере()
	Если Запись.СтавкаНДС = Справочники.Scan_СтавкиНДС.БезНДС Тогда
		Запись.СуммаНДС = 0;
	ИначеЕсли Запись.СтавкаНДС = Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС Тогда
		// rarus tenkam 24.12.2018 mantis 13896 +++
		//Запись.СуммаНДС = Запись.Сумма*0.18;
		Запись.СуммаНДС = Запись.Сумма*(Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100);
		// rarus tenkam 24.12.2018 mantis 13896 ---
	КонецЕсли;
	Запись.СуммаСНДС = Запись.Сумма + Запись.СуммаНДС;
	Если Расстояние <> 0 Тогда
		// rarus tenkam 27.12.2018 mantis 13896 +++
		//Запись.Стоимость1Км = Запись.СуммаСНДС/Расстояние;
		Запись.Стоимость1Км = Запись.Сумма/Расстояние;
		// rarus tenkam 27.12.2018 mantis 13896 ---
	Иначе
		Запись.Стоимость1Км = 0;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура СуммаСНДСПриИзменении(Элемент)
	СуммаСНДСПриИзмененииНаСервере()
КонецПроцедуры

&НаСервере
Процедура СуммаСНДСПриИзмененииНаСервере()
	Если Запись.СтавкаНДС = Справочники.Scan_СтавкиНДС.БезНДС Тогда
		Запись.Сумма = Запись.СуммаСНДС;
	ИначеЕсли Запись.СтавкаНДС = Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС Тогда
		// rarus tenkam 24.12.2018 mantis 13896 +++
		//Запись.Сумма = Запись.СуммаСНДС/1.18;
		Запись.Сумма = Запись.СуммаСНДС/(1 + Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100)
		// rarus tenkam 24.12.2018 mantis 13896 ---
	КонецЕсли;
	Запись.СуммаНДС = Запись.СуммаСНДС - Запись.Сумма;
	Если Расстояние <> 0 Тогда
		// rarus tenkam 27.12.2018 mantis 13896 +++
		//Запись.Стоимость1Км = Запись.СуммаСНДС/Расстояние;
		Запись.Стоимость1Км = Запись.Сумма/Расстояние;
		// rarus tenkam 27.12.2018 mantis 13896 ---	
	Иначе
		Запись.Стоимость1Км = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.АдресДоставки) И ЗначениеЗаполнено(Запись.АдресПолучения) Тогда
		Расстояние = ПолучитьРасстояние(Запись.АдресДоставки,Запись.АдресПолучения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРасстояние(АдресДоставки, АдресПолучения)
	
	РасстояниеМеждуАдресами = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_РасстояниеМеждуАдресами.Расстояние
		|ИЗ
		|	РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
		|ГДЕ
		|	(Scan_РасстояниеМеждуАдресами.АдресПолучения = &АдресПолучения
		|				И Scan_РасстояниеМеждуАдресами.АдресДоставки = &АдресДоставки
		|			ИЛИ Scan_РасстояниеМеждуАдресами.АдресДоставки = &АдресПолучения
		|				И Scan_РасстояниеМеждуАдресами.АдресПолучения = &АдресДоставки)";
	
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("АдресПолучения", АдресПолучения);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		РасстояниеМеждуАдресами = Результат[0].Расстояние; 
	КонецЕсли;
	
	Возврат РасстояниеМеждуАдресами;
	
КонецФункции

&НаКлиенте
Процедура АдресПолученияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.АдресДоставки) И ЗначениеЗаполнено(Запись.АдресПолучения) Тогда
		Расстояние = ПолучитьРасстояние(Запись.АдресДоставки,Запись.АдресПолучения);
	КонецЕсли;
	СуммаПриИзменении(Элемент);
КонецПроцедуры

//rarus abrant 17.07.2017 mantis 9146 ---
